{
  "metadata": {
    "topic": 43,
    "generatedAt": "2025-11-28",
    "totalQuestions": 15,
    "status": "COMPLETE"
  },
  "explanations": [
    {
      "questionId": "q-0313014645-B-13",
      "summary": "Continuous endothelium capillaries are found in lungs, skin, heart, and skeletal muscle. The spleen has SINUSOIDAL capillaries (discontinuous endothelium with gaps between cells and incomplete basement membrane), allowing direct contact between blood and splenic tissue for immune surveillance and RBC filtering.",
      "whyCorrect": {
        "a": "The spleen has sinusoidal capillaries with discontinuous endothelium. Large gaps exist between endothelial cells, and the basement membrane is incomplete. This allows RBCs to be tested for deformability and aged cells to be removed."
      },
      "whyIncorrect": {
        "b": "Lungs have continuous endothelium capillaries. The thin, continuous barrier facilitates gas exchange while preventing fluid leakage (important for keeping alveoli dry).",
        "c": "Skin capillaries have continuous endothelium, typical of most body tissues. This provides a controlled barrier for nutrient and waste exchange.",
        "d": "Heart (myocardial) capillaries have continuous endothelium, allowing regulated exchange while maintaining tissue integrity.",
        "e": "Skeletal muscle capillaries have continuous endothelium with small pores for efficient nutrient delivery during exercise."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-0313014645-B-21",
      "summary": "Plasma colloid osmotic pressure (oncotic pressure, ~25 mmHg, mainly from albumin) is the MAJOR Starling force for reabsorption. It pulls fluid from interstitium back into capillaries. The other forces (Pc, πi, Pi) either favor filtration or are relatively small.",
      "whyCorrect": {
        "d": "Plasma colloid osmotic pressure (~25 mmHg) is generated by plasma proteins (primarily albumin). It opposes filtration and promotes reabsorption by pulling water from interstitium into capillaries."
      },
      "whyIncorrect": {
        "a": "Interstitial hydrostatic pressure (~-3 to +3 mmHg) opposes filtration but is small. It can slightly promote filtration when negative (suction effect) in some tissues.",
        "b": "Interstitial colloid osmotic pressure (~8 mmHg) OPPOSES reabsorption by pulling fluid OUT of capillaries into the interstitium. It promotes filtration, not reabsorption.",
        "c": "Intracapillary hydrostatic pressure (~25-35 mmHg at arteriolar end) is the major force for FILTRATION, not reabsorption. It pushes fluid out of capillaries."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-0313014645-5",
      "summary": "Decreased interstitial colloid osmotic pressure (πi) actually DECREASES interstitial fluid volume because it reduces the force pulling fluid into the interstitium. The other conditions increase interstitial fluid: low plasma proteins (↓πc), lymphatic obstruction, increased permeability, and elevated venous pressure all promote edema.",
      "whyCorrect": {
        "c": "Decreased interstitial colloid osmotic pressure (πi) reduces the force pulling fluid from capillaries into the interstitium, thereby DECREASING interstitial fluid. This is the opposite of edema formation."
      },
      "whyIncorrect": {
        "a": "Decreased plasma proteins reduce plasma oncotic pressure (πc), decreasing reabsorption and causing fluid to accumulate in the interstitium (edema).",
        "b": "Lymphatic obstruction prevents drainage of interstitial fluid, causing it to accumulate (lymphedema).",
        "d": "Increased microvascular permeability allows proteins to leak into interstitium, raising πi and drawing more fluid out (inflammatory edema).",
        "e": "Increased venous blood pressure raises capillary hydrostatic pressure, increasing filtration and interstitial fluid volume (cardiac edema)."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-0313014645-22",
      "summary": "Small solutes like Na+ cross capillary walls primarily by DIFFUSION, driven by concentration gradients. Diffusion is extremely fast for small molecules. Filtration moves bulk fluid. Active transport doesn't occur in capillary endothelium. Vesicular transport is mainly for large molecules like albumin.",
      "whyCorrect": {
        "a": "Diffusion is the primary mechanism for small solute movement across capillaries. Na+ (and glucose, O2, CO2) diffuse rapidly through intercellular clefts and fenestrations, driven by concentration gradients. Diffusion rates are much faster than bulk flow."
      },
      "whyIncorrect": {
        "b": "Filtration moves BULK FLUID (water) with dissolved solutes across the capillary wall based on pressure gradients. It's not the primary mechanism for individual solute movement.",
        "c": "Active transport does not occur significantly in capillary endothelium. Capillaries are passive exchange vessels - they lack the energy-dependent pumps found in epithelial cells.",
        "d": "Vesicular transport (transcytosis) is used primarily for LARGE molecules like albumin that cannot pass through pores. It's too slow for small solutes like Na+."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-3543048990-63",
      "summary": "The Starling equation considers ALL FOUR FORCES: capillary hydrostatic pressure (Pc), interstitial hydrostatic pressure (Pi), plasma colloid osmotic pressure (πc), and interstitial colloid osmotic pressure (πi). Net filtration = Kf[(Pc - Pi) - σ(πc - πi)]. Sodium osmotic pressure is not relevant (crystalloids equilibrate).",
      "whyCorrect": {
        "d": "The complete Starling equation accounts for all four pressures: the hydrostatic pressure difference (Pc - Pi) favoring filtration, and the colloid osmotic pressure difference (πc - πi) favoring reabsorption. Net filtration occurs when hydrostatic forces exceed osmotic forces."
      },
      "whyIncorrect": {
        "a": "This only describes part of the equation. The concentration difference of osmotically active particles is the colloid osmotic component, but it ignores the hydrostatic component.",
        "b": "Sodium (Na+) contributes to crystalloid osmotic pressure, which equilibrates rapidly across capillaries and does NOT create effective osmotic pressure for fluid movement. Only colloids (proteins) are relevant.",
        "c": "Capillary hydrostatic pressure alone is only one of four forces. It must be balanced against interstitial hydrostatic pressure and both colloid osmotic pressures.",
        "e": "This is incomplete - it mentions plasma colloid osmotic pressure and tissue hydrostatic pressure but omits capillary hydrostatic pressure and interstitial colloid osmotic pressure."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-3543048990-64",
      "summary": "Interstitial fluid increases with: decreased plasma proteins (↓πc → less reabsorption), elevated venous pressure (↑Pc), elevated arteriolar pressure (↑Pc), and histamine (↑permeability → proteins leak → ↑πi). Decreased interstitial colloid pressure would reduce edema. A-V anastomoses bypass capillaries entirely.",
      "whyCorrect": {
        "a": "Decreased plasma proteins reduce plasma oncotic pressure (πc), decreasing the reabsorption force and causing net fluid accumulation in the interstitium.",
        "c": "Increased venous pressure raises capillary hydrostatic pressure (especially at the venular end), increasing filtration and reducing reabsorption, causing edema.",
        "d": "Increased arteriolar pressure raises capillary hydrostatic pressure (especially at the arteriolar end), increasing filtration throughout the capillary bed.",
        "f": "Histamine increases microvascular permeability, allowing proteins to leak into the interstitium. This raises interstitial oncotic pressure (πi), pulling more fluid out and causing inflammatory edema."
      },
      "whyIncorrect": {
        "b": "Decreased interstitial colloid osmotic pressure (πi) would DECREASE interstitial fluid by reducing the force pulling fluid into the interstitium.",
        "e": "Opened arteriovenous anastomoses BYPASS capillaries entirely, shunting blood directly from arterioles to venules. This reduces capillary flow and would decrease (not increase) filtration and interstitial fluid."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-4447200607-3",
      "summary": "Plasma colloid osmotic pressure (oncotic pressure, ~25 mmHg from albumin) is the major force favoring reabsorption. It pulls fluid from interstitium back into capillaries. Interstitial colloid osmotic pressure opposes this. Hydrostatic pressures primarily drive filtration.",
      "whyCorrect": {
        "c": "Plasma colloid osmotic pressure (~25 mmHg), generated primarily by albumin, draws water from the interstitium into capillaries. It is the dominant force for reabsorption, especially at the venular end where hydrostatic pressure has fallen."
      },
      "whyIncorrect": {
        "a": "Interstitial colloid osmotic pressure (~8 mmHg) OPPOSES reabsorption. It tends to pull fluid OUT of capillaries into the interstitium, promoting filtration.",
        "b": "Intracapillary hydrostatic pressure favors FILTRATION (pushing fluid out), not reabsorption.",
        "d": "Same as option b - intracapillary hydrostatic pressure drives filtration, not reabsorption."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-4447200607-12",
      "summary": "Precapillary sphincters are smooth muscle rings between arterioles and capillaries that regulate capillary perfusion. At rest, not all capillaries are open (capillary recruitment occurs with increased demand). Arteriolar dilation INCREASES (not decreases) capillary pressure. Capillaries have no smooth muscle, so sympathetic activity doesn't constrict them directly.",
      "whyCorrect": {
        "a": "Precapillary sphincters are bands of smooth muscle located at the arteriolar-capillary junction. They control which capillaries receive blood flow at any given time.",
        "b": "At rest, only 20-25% of capillaries are open (patent). This allows metabolic regulation of blood flow - when tissue needs increase, more capillaries open (recruitment)."
      },
      "whyIncorrect": {
        "c": "Arteriolar dilation INCREASES capillary pressure because it reduces upstream resistance, allowing more arterial pressure to be transmitted to capillaries. This increases filtration.",
        "d": "Capillaries have NO smooth muscle in their walls - they consist only of endothelium and basement membrane. Sympathetic activity constricts arterioles and precapillary sphincters, but not capillaries directly."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-4447200607-24",
      "summary": "Capillary reabsorption is enhanced by high plasma colloid osmotic pressure (πc), which pulls fluid into capillaries. High capillary hydrostatic pressure (Pc) OPPOSES reabsorption. High interstitial hydrostatic pressure (Pi) actually PROMOTES reabsorption by pushing fluid into capillaries. Pulmonary capillaries do have reabsorption.",
      "whyCorrect": {
        "a": "High plasma colloid osmotic pressure (πc) increases the osmotic force pulling fluid from interstitium into capillaries, directly enhancing reabsorption."
      },
      "whyIncorrect": {
        "b": "High capillary hydrostatic pressure (Pc) OPPOSES reabsorption - it pushes fluid OUT of capillaries (filtration), not in.",
        "c": "High interstitial hydrostatic pressure (Pi) actually PROMOTES reabsorption by pushing fluid toward the capillaries. This option incorrectly states it decreases reabsorption.",
        "d": "Pulmonary capillaries DO have reabsorption. Despite low hydrostatic pressures (~7-10 mmHg), plasma oncotic pressure still drives fluid back into pulmonary capillaries, keeping alveoli dry."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-4525102917-9",
      "summary": "Albumin has the slowest movement across capillary walls because of its large molecular size (~69 kDa). It crosses primarily by vesicular transport (transcytosis), which is slow. Small molecules (glucose, sodium) diffuse rapidly through intercellular clefts. Lipid-soluble oxygen diffuses freely through endothelial cell membranes.",
      "whyCorrect": {
        "c": "Albumin is a large protein (~69 kDa) that cannot pass through intercellular clefts or fenestrations. It crosses capillary walls slowly via vesicular transport (transcytosis), making its net movement rate the slowest."
      },
      "whyIncorrect": {
        "a": "Glucose (180 Da) is small and water-soluble, diffusing rapidly through intercellular clefts and fenestrations. Its movement is fast.",
        "b": "Oxygen is small and lipid-soluble, diffusing extremely rapidly directly through endothelial cell membranes. It has the fastest movement of the options listed.",
        "d": "Sodium (23 Da) is a small ion that diffuses rapidly through intercellular clefts. Its movement is fast compared to albumin."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-4525102917-24",
      "summary": "Capillary hydrostatic pressure in systemic circulation averages 15-25 mmHg (higher at arteriolar end ~32 mmHg, lower at venular end ~15 mmHg). This pressure moves fluid OUT of capillaries (filtration force). It is NOT 8-10 mmHg (that's more like pulmonary capillaries) and is definitely not negligible.",
      "whyCorrect": {
        "b": "Capillary hydrostatic pressure (Pc) drives fluid OUT of capillaries through the process of filtration. It is the major outward-directed Starling force.",
        "d": "Average capillary hydrostatic pressure in systemic circulation is 15-25 mmHg (varying from ~32 mmHg arteriolar to ~15 mmHg venular end)."
      },
      "whyIncorrect": {
        "a": "8-10 mmHg is too low for systemic capillary pressure. This value is closer to pulmonary capillary pressure (~7-10 mmHg).",
        "c": "Capillary hydrostatic pressure is NOT negligible - it's the primary driving force for filtration and essential for nutrient delivery to tissues.",
        "e": "Capillary hydrostatic pressure moves fluid OUT OF (not into) capillaries. The force that moves fluid into capillaries is plasma colloid osmotic pressure."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-4855200607-1",
      "summary": "In the LIVER and SPLEEN, there is no significant colloid osmotic pressure difference because they have sinusoidal capillaries with highly permeable walls that freely allow proteins to pass. Plasma proteins equilibrate with interstitial fluid. Other organs (intestine, muscle, lung) maintain protein gradients.",
      "whyCorrect": {
        "d": "The spleen has sinusoidal capillaries with discontinuous endothelium and gaps between cells. Plasma proteins freely pass into the splenic interstitium, eliminating the colloid osmotic gradient.",
        "e": "The liver has sinusoidal capillaries (hepatic sinusoids) with large fenestrations and no basement membrane. Plasma proteins easily enter the space of Disse, equilibrating with hepatic interstitium."
      },
      "whyIncorrect": {
        "a": "Small intestinal mucosa capillaries are fenestrated but still maintain a significant protein gradient. They allow selective filtration for nutrient absorption.",
        "b": "Skeletal muscle has continuous capillaries that effectively retain plasma proteins, maintaining a significant colloid osmotic gradient.",
        "c": "Lung capillaries have continuous endothelium with tight junctions, maintaining a protein gradient essential for keeping alveoli dry."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-4855200607-4",
      "summary": "Plasma colloid osmotic pressure (oncotic pressure, ~25 mmHg) is the primary Starling force driving reabsorption. Generated mainly by albumin, it draws fluid from interstitium into capillaries. Interstitial colloid osmotic pressure opposes this. Hydrostatic pressures primarily affect filtration.",
      "whyCorrect": {
        "d": "Plasma colloid osmotic pressure (~25 mmHg, mainly albumin) is the dominant force pulling fluid from interstitium into capillaries. It's responsible for ~90% of reabsorption force."
      },
      "whyIncorrect": {
        "a": "Interstitial hydrostatic pressure (Pi, ~-3 to +3 mmHg) is small and can promote or oppose filtration depending on whether it's negative or positive. It's not the major reabsorption force.",
        "b": "Interstitial colloid osmotic pressure (πi, ~8 mmHg) OPPOSES reabsorption by pulling fluid OUT of capillaries into the interstitium.",
        "c": "Intracapillary hydrostatic pressure (Pc, ~25-35 mmHg) is the major FILTRATION force, pushing fluid out of capillaries, not in."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-4855200607-25",
      "summary": "The LIVER and SPLEEN have sinusoidal capillaries where plasma proteins freely equilibrate with interstitial fluid, eliminating the colloid osmotic gradient. Other organs with fenestrated (intestine) or continuous (muscle, lung) capillaries maintain protein gradients.",
      "whyCorrect": {
        "d": "The spleen has sinusoidal capillaries with large intercellular gaps and incomplete basement membrane. Proteins pass freely, so πc ≈ πi.",
        "e": "The liver has sinusoidal capillaries (hepatic sinusoids) that are highly permeable to proteins. Plasma proteins freely enter the space of Disse."
      },
      "whyIncorrect": {
        "a": "Lung capillaries have continuous endothelium with tight junctions, maintaining a significant protein gradient to prevent pulmonary edema.",
        "b": "Skeletal muscle has continuous capillaries that retain plasma proteins, maintaining normal colloid osmotic gradient.",
        "c": "Small intestinal mucosal capillaries are fenestrated for nutrient absorption but still maintain protein gradients."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    },
    {
      "questionId": "q-5156012322-23",
      "summary": "Precapillary sphincters regulate capillary blood flow by controlling which capillaries are perfused. At rest, not all capillaries are open (capillary recruitment). Arteriolar dilation INCREASES (not decreases) capillary pressure. Capillaries lack smooth muscle, so they cannot constrict directly from sympathetic activity.",
      "whyCorrect": {
        "b": "Precapillary sphincters are smooth muscle rings that control blood flow into individual capillaries. They respond to local metabolic factors (O2, CO2, adenosine) and neural/hormonal signals.",
        "d": "At rest, only 20-25% of capillaries are perfused. When metabolic demand increases, precapillary sphincters relax, recruiting more capillaries to increase surface area for exchange."
      },
      "whyIncorrect": {
        "a": "Arteriolar dilation INCREASES capillary pressure because it decreases pre-capillary resistance, allowing more of the arterial pressure to reach the capillary bed.",
        "c": "Capillaries have NO smooth muscle - they cannot constrict. They consist only of endothelial cells and basement membrane. Sympathetic activity affects arterioles and precapillary sphincters, not capillaries directly."
      },
      "topicReference": "Topic 43: Microcirculation, Starling Forces"
    }
  ]
}
